

import math
import random


def test_greetings():
    # Напишите программу, которая выводит на экран приветствие.

    name = 'Дамир'
    age = '37'

    text = "Привет, меня зовут {name}. Мне {age} лет."
    print(text)
